tiborsimon/embedded-tdd-headers/pic/pic18/pic18f96j99_tdd.h
#define CM1CON_COE                    2765
#define COE1                          2766
#define CM1CON_CON                    2767
#define CON1                          2768
#define PADCFG1                       2769
#define RLPU                          2770
#define PMPTTL                        2771
#define RKPU                          2772
#define PADCFG1_RJPU                  2773
#define RHPU                          2774
#define RGPU                          2775
#define RFPU                          2776
#define REPU                          2777
#define RDPU                          2778
#define IOCN                          2779
#define IOCN0                         2780
#define IOCN1                         2781
#define IOCN2                         2782
#define IOCN3                         2783
#define IOCN4                         2784
#define IOCN5                         2785
#define IOCN6                         2786
#define IOCN7                         2787
#define IOCP                          2788
#define IOCP0                         2789
#define IOCP1                         2790
#define IOCP2                         2791
#define IOCP3                         2792
#define IOCP4                         2793
#define IOCP5                         2794
#define IOCP6                         2795
#define IOCP7                         2796
#define RTCCON2                       2797
#define RTCSECSEL                     2798
#define RTCSECSEL0                    2799
#define RTCSECSEL1                    2800
#define RTCCLKSEL0                    2801
#define RTCCLKSEL                     2802
#define RTCCLKSEL1                    2803
#define PWCSPRE                       2804
#define PWCCPRE                       2805
#define PWCPOL                        2806
#define PWCEN                         2807
#define ALRMVALL                      2808
#define ALRMVALH                      2809
#define ALRMRPT                       2810
#define ARPT0                         2811
#define ARPT                          2812
#define ARPT1                         2813
#define ARPT2                         2814
#define ARPT3                         2815
#define ARPT4                         2816
#define ARPT5                         2817
#define ARPT6                         2818
#define ARPT7                         2819
#define ALRMCFG                       2820
#define ALRMPTR                       2821
#define ALRMPTR0                      2822
#define ALRMPTR1                      2823
#define AMASK0                        2824
#define AMASK                         2825
#define AMASK1                        2826
#define AMASK2                        2827
#define AMASK3                        2828
#define CHIME                         2829
#define ALRMEN                        2830
#define RTCVALL                       2831
#define WAITE0                        2832
#define RTCVALH                       2833
#define WAITE1                        2834
#define WAITM0                        2835
#define WAITM1                        2836
#define WAITM2                        2837
#define WAITM3                        2838
#define WAITB0                        2839
#define WAITB1                        2840
#define RTCCAL                        2841
#define CAL0                          2842
#define CAL                           2843
#define CAL1                          2844
#define CAL2                          2845
#define CAL3                          2846
#define CAL4                          2847
#define CAL5                          2848
#define CAL6                          2849
#define CAL7                          2850
#define RTCCON1                       2851
#define RTCPTR0                       2852
#define RTCPTR                        2853
#define RTCPTR1                       2854
#define RTCOE                         2855
#define HALFSEC                       2856
#define RTCSYNC                       2857
#define RTCWREN                       2858
#define RTCEN                         2859
#define DMACON1                       2860
#define DMAEN                         2861
#define DLYINTEN                      2862
#define DUPLEX                        2863
#define DUPLEX0                       2864
#define DUPLEX1                       2865
#define RXINC                         2866
#define TXINC                         2867
#define SSCON                         2868
#define SSCON0                        2869
#define SSCON1                        2870
#define PIE6                          2871
#define CMP1IE                        2872
#define CMP2IE                        2873
#define CMP3IE                        2874
#define TX3IE                         2875
#define RC3IE                         2876
#define TX4IE                         2877
#define RC4IE                         2878
#define WPUB                          2879
#define WPUB0                         2880
#define WPUB1                         2881
#define WPUB2                         2882
#define WPUB3                         2883
#define WPUB4                         2884
#define WPUB5                         2885
#define WPUB6                         2886
#define WPUB7                         2887
#define ACTCON                        2888
#define ACTORSPOL                     2889
#define ACTORS                        2890
#define ACTLOCKPOL                    2891
#define ACTLOCK                       2892
#define ACTSRC                        2893
#define ACTSIDL                       2894
#define ACTEN                         2895
#define OSCCON4                       2896
#define PLLEN                         2897
#define CPDIV0                        2898
#define CPDIV                         2899
#define CPDIV1                        2900
#define OSCCON3                       2901
#define IRCF                          2902
#define IRCF0                         2903
#define IRCF1                         2904
#define IRCF2                         2905
#define OSCCON2                       2906
#define SOSCGO                        2907
#define POSCEN                        2908
#define CF                            2909
#define LOCK                          2910
#define IOLOCK                        2911
#define CLKLOCK                       2912
#define BAUDCON1                      2913
#define BAUDCON1_ABDEN                2914
#define ABDEN1                        2915
#define BAUDCON1_WUE                  2916
#define WUE1                          2917
#define BAUDCON1_IREN                 2918
#define BRG161                        2919
#define BAUDCON1_BRG16                2920
#define CKTXP                         2921
#define BAUDCON1_TXCKP                2922
#define SCKP1                         2923
#define TXCKP1                        2924
#define SCKP                          2925
#define DTRXP1                        2926
#define RXDTP1                        2927
#define DTRXP                         2928
#define RXCKP                         2929
#define BAUDCON1_RXDTP                2930
#define RCMT1                         2931
#define RCIDL1                        2932
#define BAUDCON1_RCIDL                2933
#define RCMT                          2934
#define ABDOVF1                       2935
#define BAUDCON1_ABDOVF               2936
#define SSP1MSK                       2937
#define SSP1MSK_MSK0                  2938
#define SSP1MSK_SSPMSK                2939
#define SSP1MSK_MSK1                  2940
#define SSP1MSK_MSK2                  2941
#define SSP1MSK_MSK3                  2942
#define SSP1MSK_MSK4                  2943
#define SSP1MSK_MSK5                  2944
#define SSP1MSK_MSK6                  2945
#define SSP1MSK_MSK7                  2946
#define SSP1CON3                      2947
#define SSP1CON3_DHEN                 2948
#define SSP1CON3_AHEN                 2949
#define SSP1CON3_SBCDE                2950
#define SSP1CON3_SDAHT                2951
#define SSP1CON3_BOEN                 2952
#define SSP1CON3_SCIE                 2953
#define SSP1CON3_PCIE                 2954
#define SSP1CON3_ACKTIM               2955
#define TXBUF0                        2956
#define TXBUF                         2957
#define TXBUF1                        2958
#define TXBUF2                        2959
#define TXBUF3                        2960
#define TXBUF4                        2961
#define TXBUF5                        2962
#define TXBUF6                        2963
#define TXBUF7                        2964
#define DMABCH                        2965
#define BC8                           2966
#define DMACNTHB                      2967
#define BC9                           2968
#define DMABCL                        2969
#define DMACNTLB                      2970
#define BC0                           2971
#define BC1                           2972
#define BC2                           2973
#define BC3                           2974
#define BC4                           2975
#define BC5                           2976
#define BC6                           2977
#define BC7                           2978
#define RXADDRH                       2979
#define RXADDR8                       2980
#define DMARCVPTRHB                   2981
#define RXADDR9                       2982
#define RXADDR10                      2983
#define RXADDR11                      2984
#define RXADDRL                       2985
#define DMARCVPTRLB                   2986
#define RXADDR0                       2987
#define RXADDR1                       2988
#define RXADDR2                       2989
#define RXADDR3                       2990
#define RXADDR4                       2991
#define RXADDR5                       2992
#define RXADDR6                       2993
#define RXADDR7                       2994
#define TXADDRH                       2995
#define TXADDR8                       2996
#define DMATXPTRHB                    2997
#define TXADDR9                       2998
#define TXADDR10                      2999
#define TXADDR11                      3000
#define TXADDRL                       3001
#define DMATXPTRLB                    3002
#define TXADDR0                       3003
#define TXADDR1                       3004
#define TXADDR2                       3005
#define TXADDR3                       3006
#define TXADDR4                       3007
#define TXADDR5                       3008
#define TXADDR6                       3009
#define TXADDR7                       3010
#define PORTVP                        3011
#define RVP0                          3012
#define RVP1                          3013
#define RVP2                          3014
#define RVP3                          3015
#define RVP4                          3016
#define RVP5                          3017
#define RVP6                          3018
#define RVP7                          3019
#define LATVP                         3020
#define LATVP0                        3021
#define LATVP1                        3022
#define LATVP2                        3023
#define LATVP3                        3024
#define LATVP4                        3025
#define LATVP5                        3026
#define LATVP6                        3027
#define LATVP7                        3028
#define TRISVP                        3029
#define TRISVP0                       3030
#define TRISVP1                       3031
#define TRISVP2                       3032
#define TRISVP3                       3033
#define TRISVP4                       3034
#define TRISVP5                       3035
#define TRISVP6                       3036
#define TRISVP7                       3037
#define UADDR                         3038
#define ADDR                          3039
#define ADDR0                         3040
#define ADDR1                         3041
#define ADDR2                         3042
#define ADDR3                         3043
#define ADDR4                         3044
#define ADDR5                         3045
#define ADDR6                         3046
#define UCON                          3047
#define SUSPND                        3048
#define RESUME                        3049
#define USBEN                         3050
#define PKTDIS                        3051
#define SE0                           3052
#define PPBRST                        3053
#define USTAT                         3054
#define PPBI                          3055
#define DIR                           3056
#define ENDP                          3057
#define ENDP0                         3058
#define ENDP1                         3059
#define ENDP2                         3060
#define ENDP3                         3061
#define UEIR                          3062
#define PIDEF                         3063
#define CRC5EF                        3064
#define CRC16EF                       3065
#define DFN8EF                        3066
#define BTOEF                         3067
#define BTSEF                         3068
#define UIR                           3069
#define URSTIF                        3070
#define UERRIF                        3071
#define ACTVIF                        3072
#define TRNIF                         3073
#define IDLEIF                        3074
#define STALLIF                       3075
#define SOFIF                         3076
#define UFRMH                         3077
#define FRM8                          3078
#define UFRMH_FRM                     3079
#define FRM9                          3080
#define FRM10                         3081
#define UFRML                         3082
#define FRML                          3083
#define FRM0                          3084
#define UFRML_FRM                     3085
#define FRM1                          3086
#define FRM2                          3087
#define FRM3                          3088
#define FRM4                          3089
#define FRM5                          3090
#define FRM6                          3091
#define FRM7                          3092
#define RCON4                         3093
#define PMSLP                         3094
#define DPSLP                         3095
#define SRETEN                        3096
#define RCON3                         3097
#define VBAT                          3098
#define VBPOR                         3099
#define VDDPOR                        3100
#define VDDBOR                        3101
#define STKERR                        3102
#define RCON2                         3103
#define SWDTEN                        3104
#define EXTR                          3105
#define EECON2                        3106
#define EECON1                        3107
#define WR                            3108
#define WREN                          3109
#define WRERR                         3110
#define FREE                          3111
#define WWPROG                        3112
#define PORTA                         3113
#define ULPWUIN                       3114
#define RA0                           3115
#define RA1                           3116
#define RA2                           3117
#define RA3                           3118
#define RA4                           3119
#define LVDIN                         3120
#define RA5                           3121
#define RA6                           3122
#define PORTA_RJPU                    3123
#define RA7                           3124
#define PORTB                         3125
#define RB0                           3126
#define RB1                           3127
#define RB2                           3128
#define CCP2_PA2                      3129
#define RB3                           3130
#define RB4                           3131
#define RB5                           3132
#define RB6                           3133
#define RB7                           3134
#define PORTC                         3135
#define RC0                           3136
#define PA2                           3137
#define RC1                           3138
#define CCP2                          3139
#define PA1                           3140
#define RC2                           3141
#define RC3                           3142
#define RC4                           3143
#define RC5                           3144
#define RC6                           3145
#define RC7                           3146
#define PORTD                         3147
#define RD0                           3148
#define RD1                           3149
#define RD2                           3150
#define RD3                           3151
#define RD4                           3152
#define RD5                           3153
#define RD6                           3154
#define RD7                           3155
#define SS2                           3156
#define PORTE                         3157
#define PD2                           3158
#define RDE                           3159
#define RE0                           3160
#define WRE                           3161
#define RE1                           3162
#define PC2                           3163
#define PORTE_CS                      3164
#define CCP10                         3165
#define PB2                           3166
#define RE2                           3167
#define CCP9E                         3168
#define RE3                           3169
#define PC3E                          3170
#define PB3E                          3171
#define RE4                           3172
#define CCP8E                         3173
#define CCP7E                         3174
#define RE5                           3175
#define PC1E                          3176
#define CCP6E                         3177
#define RE6                           3178
#define PB1E                          3179
#define CCP2E                         3180
#define PA2E                          3181
#define RE7                           3182
#define PORTF                         3183
#define RF2                           3184
#define C1OUTF                        3185
#define RF3                           3186
#define RF4                           3187
#define RF5                           3188
#define RF6                           3189
#define RF7                           3190
#define PORTG                         3191
#define RG0                           3192
#define RG1                           3193
#define C3OUTG                        3194
#define RG2                           3195
#define RG3                           3196
#define RG4                           3197
#define RG6                           3198
#define RG7                           3199
#define PORTH                         3200
#define RH0                           3201
#define RH1                           3202
#define RH2                           3203
#define RH3                           3204
#define RH4                           3205
#define CCP9                          3206
#define PC3                           3207
#define PB3                           3208
#define RH5                           3209
#define CCP8                          3210
#define PC1                           3211
#define RH6                           3212
#define CCP7                          3213
#define PB1                           3214
#define RH7                           3215
#define CCP6                          3216
#define PORTJ                         3217
#define RJ0                           3218
#define RJ1                           3219
#define RJ2                           3220
#define RJ3                           3221
#define RJ4                           3222
#define RJ5                           3223
#define RJ6                           3224
#define RJ7                           3225
#define LATA                          3226
#define LATA0                         3227
#define LA0                           3228
#define LATA1                         3229
#define LA1                           3230
#define LATA2                         3231
#define LA2                           3232
#define LATA3                         3233
#define LA3                           3234
#define LATA4                         3235
#define LA4                           3236
#define LATA5                         3237
#define LA5                           3238
#define LATA6                         3239
#define LA6                           3240
#define LATA7                         3241
#define LA7                           3242
#define LATB                          3243
#define LB0                           3244
#define LATB0                         3245
#define LB1                           3246
#define LATB1                         3247
#define LB2                           3248
#define LATB2                         3249
#define LB3                           3250
#define LATB3                         3251
#define LB4                           3252
#define LATB4                         3253
#define LB5                           3254
#define LATB5                         3255
#define LB6                           3256
#define LATB6                         3257
#define LB7                           3258
#define LATB7                         3259
#define LATC                          3260
#define LATC0                         3261
#define LC0                           3262
#define LATC1                         3263
#define LC1                           3264
#define LATC2                         3265
#define LC2                           3266
#define LATC3                         3267
#define LC3                           3268
#define LATC4                         3269
#define LC4                           3270
#define LATC5                         3271
#define LC5                           3272
#define LATC6                         3273
#define LC6                           3274
#define LATC7                         3275
#define LC7                           3276
#define LATD                          3277
#define LATD0                         3278
#define LD0                           3279
#define LATD1                         3280
#define LD1                           3281
#define LATD2                         3282
#define LD2                           3283
#define LATD3                         3284
#define LD3                           3285
#define LATD4                         3286
#define LD4                           3287
#define LATD5                         3288
#define LD5                           3289
#define LATD6                         3290
#define LD6                           3291
#define LATD7                         3292
#define LD7                           3293
#define LATE                          3294
#define LATE0                         3295
#define LE0                           3296
#define LATE1                         3297
#define LE1                           3298
#define LATE2                         3299
#define LE2                           3300
#define LATE3                         3301
#define LE3                           3302
#define LATE4                         3303
#define LE4                           3304
#define LATE5                         3305
#define LE5                           3306
#define LATE6                         3307
#define LE6                           3308
#define LATE7                         3309
#define LE7                           3310
#define LATF                          3311
#define LF2                           3312
#define LATF2                         3313
#define LF3                           3314
#define LATF3                         3315
#define LF4                           3316
#define LATF4                         3317
#define LF5                           3318
#define LATF5                         3319
#define LF6                           3320
#define LATF6                         3321
#define LF7                           3322
