tiborsimon/embedded-tdd-headers/pic/pic18/pic18f96j99_tdd.h
#define SSP1STAT_SMP                  3881
#define SMP1                          3882
#define SSP1ADD                       3883
#define SSP1ADD_SSPADD                3884
#define SSP1ADD_MSK0                  3885
#define MSK01                         3886
#define SSP1ADD_MSK1                  3887
#define MSK11                         3888
#define SSP1ADD_MSK2                  3889
#define MSK21                         3890
#define MSK31                         3891
#define SSP1ADD_MSK3                  3892
#define SSP1ADD_MSK4                  3893
#define MSK41                         3894
#define SSP1ADD_MSK5                  3895
#define MSK51                         3896
#define MSK61                         3897
#define SSP1ADD_MSK6                  3898
#define SSP1ADD_MSK7                  3899
#define MSK71                         3900
#define SSP1BUF                       3901
#define SSP1BUF_SSPBUF                3902
#define T2CON                         3903
#define T2CKPS0                       3904
#define T2CKPS                        3905
#define T2CKPS1                       3906
#define TMR2ON                        3907
#define T2OUTPS0                      3908
#define T2OUTPS                       3909
#define T2OUTPS1                      3910
#define T2OUTPS2                      3911
#define T2OUTPS3                      3912
#define PR2                           3913
#define TMR2                          3914
#define T1CON                         3915
#define TMR1ON                        3916
#define T1CON_RD16                    3917
#define NOT_T1SYNC                    3918
#define nT1SYNC                       3919
#define T1CON_SOSCEN                  3920
#define T1OSCEN                       3921
#define T1CKPS0                       3922
#define T1CON_TCKPS                   3923
#define T1CKPS1                       3924
#define TMR1CS0                       3925
#define TMR1CS                        3926
#define T1RD16                        3927
#define TMR1CS1                       3928
#define TMR1L                         3929
#define TMR1H                         3930
#define RCON                          3931
#define RCON_BOR                      3932
#define NOT_BOR                       3933
#define nBOR                          3934
#define POR                           3935
#define nPOR                          3936
#define NOT_POR                       3937
#define PD                            3938
#define nPD                           3939
#define NOT_PD                        3940
#define nTO                           3941
#define TO                            3942
#define NOT_TO                        3943
#define nRI                           3944
#define NOT_RI                        3945
#define RI                            3946
#define NOT_CM                        3947
#define RCON_CM                       3948
#define nCM                           3949
#define IPEN                          3950
#define IOCF                          3951
#define IOCF0                         3952
#define IOCF1                         3953
#define IOCF2                         3954
#define IOCF3                         3955
#define IOCF4                         3956
#define IOCF5                         3957
#define IOCF6                         3958
#define IOCF7                         3959
#define IPR5                          3960
#define CCH05                         3961
#define TMR4IP                        3962
#define CCH15                         3963
#define TMR5IP                        3964
#define TMR6IP                        3965
#define EVPOL15                       3966
#define TMR8IP                        3967
#define ACTLOCKIP                     3968
#define ACTORSIP                      3969
#define OSCCON                        3970
#define NOSC0                         3971
#define NOSC                          3972
#define SCS                           3973
#define NOSC1                         3974
#define NOSC2                         3975
#define COSC                          3976
#define COSC0                         3977
#define COSC1                         3978
#define COSC2                         3979
#define IDLEN                         3980
#define T0CON                         3981
#define T0PS                          3982
#define T0PS0                         3983
#define T0PS1                         3984
#define T0PS2                         3985
#define PSA                           3986
#define T0CS                          3987
#define T0CS0                         3988
#define T0CS1                         3989
#define T08BIT                        3990
#define TMR0ON                        3991
#define TMR0L                         3992
#define TMR0H                         3993
#define STATUS                        3994
#define C                             3995
#define CARRY                         3996
#define DC                            3997
#define ZERO                          3998
#define Z                             3999
#define OV                            4000
#define OVERFLOW                      4001
#define N                             4002
#define NEGATIVE                      4003
#define FSR2L                         4004
#define PLUSW2                        4005
#define PREINC2                       4006
#define POSTDEC2                      4007
#define POSTINC2                      4008
#define INDF2                         4009
#define FSR1L                         4010
#define PLUSW1                        4011
#define PREINC1                       4012
#define POSTDEC1                      4013
#define POSTINC1                      4014
#define INDF1                         4015
#define WREG                          4016
#define FSR0L                         4017
#define PLUSW0                        4018
#define PREINC0                       4019
#define POSTDEC0                      4020
#define POSTINC0                      4021
#define INDF0                         4022
#define INTCON3                       4023
#define INT1IF                        4024
#define INT1F                         4025
#define INT2IF                        4026
#define INT2F                         4027
#define INT3F                         4028
#define INT3IF                        4029
#define INT1E                         4030
#define INT1IE                        4031
#define INT2IE                        4032
#define INT2E                         4033
#define INT3E                         4034
#define INT3IE                        4035
#define INT1P                         4036
#define INT1IP                        4037
#define INT2IP                        4038
#define INT2P                         4039
#define INTCON2                       4040
#define IOCIP                         4041
#define INT3IP                        4042
#define INT3P                         4043
#define TMR0IP                        4044
#define T0IP                          4045
#define INTEDG3                       4046
#define INTEDG2                       4047
#define INTEDG1                       4048
#define INTEDG0                       4049
#define NOT_RBPU                      4050
#define RBPU                          4051
#define nRBPU                         4052
#define INTCON                        4053
#define IOCIF                         4054
#define INT0F                         4055
#define INT0IF                        4056
#define T0IF                          4057
#define TMR0IF                        4058
#define IOCIE                         4059
#define INT0E                         4060
#define INT0IE                        4061
#define T0IE                          4062
#define TMR0IE                        4063
#define PEIE                          4064
#define PEIE_GIEL                     4065
#define GIEL                          4066
#define GIEH                          4067
#define GIE_GIEH                      4068
#define GIE                           4069
#define PRODL                         4070
#define PRODH                         4071
#define TABLAT                        4072
#define TBLPTRL                       4073
#define TBLPTRH                       4074
#define PCL                           4075
#define PCLATH                        4076
#define PCH                           4077
#define SP0                           4078
#define STKPTR                        4079
#define SP1                           4080
#define SP2                           4081
#define SP3                           4082
#define SP4                           4083
#define STKUNF                        4084
#define STKOVF                        4085
#define STKFUL                        4086
#define TOSL                          4087
#define TOSH                          4088

#endif // _PIC18F96J99_H_
